
.include "macrolib.asm"

.globl array_chars1, array_chars2, file_name newstr1 newstr2
.eqv    SIZE 512                # размер буфера

.data
	file_name:      .space SIZE		# Имячитаемого файла
	array_chars1: 	.space SIZE
	array_chars2: 	.space SIZE
	newstr1:	.space SIZE		# Буфер для новой строки, output
	newstr2:	.space SIZE		# Буфер для новой строки, output
	output_file_name1: .asciz "Введите имя для первого файла вывода строки (с расширением .txt): "
	output_file_name2: .asciz "Введите имя для второго файла вывода строки (с расширением .txt): "
	prompt:         .asciz "Введите путь до читаемого файла: "     
	
	choice_exit:	.asciz "Хотите ли вы завершить работу программы [Y/N]: "
	
.text
	j main 		# При первом проходе скипаем, тк буфферы пустые.
	
	#========================================================================================================================#
	
# Чистим буфферы для повторного использования.
	la t6 clear_buffers
	jalr t6	

main:
        #========================================================================================================================#
        
       	print_str(prompt) 
       	la t6 read_name		# Ввод имени файлика, который необходимо будет считать.
	jalr t6
	la t6  open_read_file
	jalr t6 
	mv s8 a0 		# Сохранение адреса начала буффера.
	mv s7 a1		# Сохранение величины прочитанной строки.
	
    	print_str(prompt)
    	la t6 read_name		# Ввод имени файлика, который необходимо будет считать.
	jalr t6
	la t6  open_read_file
	jalr t6
	
	mv s6 a0		# Сохранение адреса начала буффера.
	mv s5 a1		# Сохранение величины прочитанной строки.
        
        #========================================================================================================================#
        
        create_array_uniq(array_chars1, s8, s10) # Макрос для создания массива уникальных символов из строки
	create_array_uniq(array_chars2, s6, s9) # Макрос для создания массива уникальных символов из строки
	
	compare(newstr1, array_chars1,s10, array_chars2,s9) # Макрос для создания строки с разностью символов строк путем сравнивания 2 массивов.
	
	compare(newstr2, array_chars2,s9, array_chars1,s10) # Макрос для создания строки с разностью символов строк путем сравнивания 2 массивов.
	
	#========================================================================================================================#

	la t6 choice
	jalr t6
	
	#========================================================================================================================#
	
output:
	print_str(output_file_name1)
	la t6 read_name		# Ввод имени файлика, который необходимо будет сохранить.
       	jalr t6
    	la a1 newstr1		# Передаю параметры (а1 - адрес начала буффера строки, а2 - размер) в подпрограмму
    	mv a2 s10
    	la t6 save_file		# Подпрограмма для сохранения файлов
	jalr t6
    	
    	print_str(output_file_name2)
    	la t6 read_name		# Ввод имени файлика, который необходимо будет сохранить.
       	jalr t6
    	la a1 newstr2		# Передаю параметры (а1 - адрес начала буффера строки, а2 - размер) в подпрограмму
    	mv a2 s9
    	la t6 save_file		# Подпрограмма для сохранения файлов
	jalr t6

	#========================================================================================================================#
	
	print_str(choice_exit)	# Запрашиваю у пользователя хочет ли он продолжить работу программы
	la t6 check_choice
	jalr t6
	beqz a0 clear_buffers	# Если да, переходим в отдел чисты буфферов по новой.

    	exit
	
        #========================================================================================================================#
